# ForgeTypeId Operators

---
The ForgeTypeId type exposes the following members.
| Name| Description
---|---|---
| Equality(ForgeTypeId, ForgeTypeId)|
| Inequality(ForgeTypeId, ForgeTypeId)|
| LessThan(ForgeTypeId, ForgeTypeId)|
Top
#### Reference
ForgeTypeId Class
Autodesk.Revit.DB Namespace